Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/atdf/PIC32MK0512GPH048.atdf
         <register caption="Interrupt Register" name="CFD1INT" offset="0x70" rw="RW" size="4">
            <bitfield caption="Transmit Object Interrupt Flag bit" mask="0x00000001" name="TXIF" values="CFD1INT__TXIF" />
            <bitfield caption="Receive Object Interrupt Flag bit" mask="0x00000002" name="RXIF" values="CFD1INT__RXIF" />
            <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="TBCIF" values="CFD1INT__TBCIF" />
            <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="CFD1INT__MODIF" />
            <bitfield caption="Transmit Event FIFO Interrupt Flag bit" mask="0x00000010" name="TEFIF" values="CFD1INT__TEFIF" />
            <bitfield caption="Transmit Attempt Interrupt Flag bit" mask="0x00000400" name="TXATIF" values="CFD1INT__TXATIF" />
            <bitfield caption="Receive Object Overflow Interrupt Flag bit" mask="0x00000800" name="RXOVIF" values="CFD1INT__RXOVIF" />
            <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="CFD1INT__SERRIF" />
            <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="CFD1INT__CERRIF" />
            <bitfield caption="Bus Wake Up Activity Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="CFD1INT__WAKIF" />
            <bitfield caption="Invalid Message Interrupt Flag bit" mask="0x00008000" name="IVMIF" values="CFD1INT__IVMIF" />
            <bitfield caption="Transmit Object Interrupt Enable bit" mask="0x00010000" name="TXIE" values="CFD1INT__TXIE" />
            <bitfield caption="Receive Object Interrupt Enable bit" mask="0x00020000" name="RXIE" values="CFD1INT__RXIE" />
            <bitfield caption="CAN Timer Interrupt Enable bit" mask="0x00040000" name="TBCIE" values="CFD1INT__TBCIE" />
            <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="CFD1INT__MODIE" />
            <bitfield caption="Transmit Event FIFO Interrupt Enable bit" mask="0x00100000" name="TEFIE" values="CFD1INT__TEFIE" />
            <bitfield caption="Transmit Attempt Interrupt Enable bit" mask="0x04000000" name="TXATIE" values="CFD1INT__TXATIE" />
            <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RXOVIE" values="CFD1INT__RXOVIE" />
            <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="CFD1INT__SERRIE" />
            <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="CFD1INT__CERRIE" />
            <bitfield caption="Bus Wake Up Activity Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="CFD1INT__WAKIE" />
            <bitfield caption="Invalid Message Interrupt Enable bit" mask="0x80000000" name="IVMIE" values="CFD1INT__IVMIE" />
         </register>
         <register caption="Receive Interrupt Status Register" name="CFD1RXIF" offset="0x80" rw="RW" size="4">
            <bitfield caption="Receive FIFO Interrupt Pending bits" mask="0xFFFFFFFE" name="RFIF" values="CFD1RXIF__RFIF" />
         </register>
         <register caption="Transmit Interrupt Status Register" name="CFD1TXIF" offset="0x90" rw="RW" size="4">
            <bitfield caption="Transmit FIFO/Transmit Queue Interrupt Pending bits" mask="0xFFFFFFFF" name="TFIF" values="CFD1TXIF__TFIF" />
         </register>
         <register caption="Receive Overflow Interrupt Status Register" name="CFD1RXOVIF" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Receive FIFO Overflow Interrupt Pending bits" mask="0xFFFFFFFE" name="RFOVIF" values="CFD1RXOVIF__RFOVIF" />
         </register>
         <register caption="Transmit Attempt Interrupt Status Register" name="CFD1TXATIF" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Transmit FIFO/Transmit Queue Attempt Interrupt Pending bits" mask="0xFFFFFFFF" name="TFATIF" values="CFD1TXATIF__TFATIF" />
         </register>
         <register caption="Transmit Request Register" name="CFD1TXREQ" offset="0xc0" rw="RW" size="4">
            <bitfield caption="Message Send Request bits" mask="0xFFFFFFFF" name="TXREQ" />
         </register>
         <register caption="Transmit/Receive Error Count Register" name="CFD1TREC" offset="0xd0" rw="R" size="4">
            <bitfield caption="Receive Error Counter bits" mask="0x000000FF" name="RERRCNT" values="CFD1TREC__RERRCNT" />
            <bitfield caption="Transmit Error Counter bits" mask="0x0000FF00" name="TERRCNT" values="CFD1TREC__TERRCNT" />
            <bitfield caption="Transmitter or Receiver is in Error State Warning bit" mask="0x00010000" name="EWARN" values="CFD1TREC__EWARN" />
            <bitfield caption="Receiver in Error State Warning bit (128 greater than RERRCNT greater than 95)" mask="0x00020000" name="RXWARN" values="CFD1TREC__RXWARN" />
            <bitfield caption="Transmitter in Error State Warning bit (128 greater than TERRCNT greater than 95)" mask="0x00040000" name="TXWARN" values="CFD1TREC__TXWARN" />
            <bitfield caption="Receiver in Error State Bus Passive bit (RERRCNT greater than 127)" mask="0x00080000" name="RXBP" values="CFD1TREC__RXBP" />
            <bitfield caption="Transmitter in Error State Bus Passive bit (TERRCNT greater than 127)" mask="0x00100000" name="TXBP" values="CFD1TREC__TXBP" />
            <bitfield caption="Transmitter in Error State Bus Off bit (TERRCNT greater than 255)" mask="0x00200000" name="TXBO" values="CFD1TREC__TXBO" />
         </register>
         <register caption="Bus Diagnostics Register 0" name="CFD1BDIAG0" offset="0xe0" rw="RW" size="4">
            <bitfield caption="Nominal Bit Rate Receive Error Counter bits" mask="0x000000FF" name="NRERRCNT" />
            <bitfield caption="Nominal Bit Rate Transmit Error Counter bits" mask="0x0000FF00" name="NTERRCNT" />
            <bitfield caption="Data Bit Rate Receive Error Counter bits" mask="0x00FF0000" name="DRERRCNT" />
            <bitfield caption="Data Bit Rate Transmit Error Counter bits" mask="0xFF000000" name="DTERRCNT" />
         </register>
         <register caption="Bus Diagnostics Register " name="CFD1BDIAG1" offset="0xf0" rw="RW" size="4">
            <bitfield caption="Error Free Message Counter Status bits" mask="0x0000FFFF" name="EFMSGCNT" values="CFD1BDIAG1__EFMSGCNT" />
            <bitfield caption="Nominal Bit Logical 0 Error Status bit" mask="0x00010000" name="NBIT0ERR" values="CFD1BDIAG1__NBIT0ERR" />
            <bitfield caption="Nominal Bit Logical 1 Error Status bit" mask="0x00020000" name="NBIT1ERR" values="CFD1BDIAG1__NBIT1ERR" />
            <bitfield caption="Not Acknowledged Error Status bit" mask="0x00040000" name="NACKERR" values="CFD1BDIAG1__NACKERR" />
            <bitfield caption="Nominal Format Error Status bit" mask="0x00080000" name="NFORMERR" values="CFD1BDIAG1__NFORMERR" />
            <bitfield caption="Nominal Stuffing Error Status bit" mask="0x00100000" name="NSTUFERR" values="CFD1BDIAG1__NSTUFERR" />
            <bitfield caption="Nominal CRC Error Status bit" mask="0x00200000" name="NCRCERR" values="CFD1BDIAG1__NCRCERR" />
            <bitfield caption="Transmit Bus Off Error Status bit" mask="0x00800000" name="TXBOERR" values="CFD1BDIAG1__TXBOERR" />
            <bitfield caption="Data Bit Logical 0 Error Status bit" mask="0x01000000" name="DBIT0ERR" values="CFD1BDIAG1__DBIT0ERR" />
            <bitfield caption="Data Bit Logical 1 Error Status bit" mask="0x02000000" name="DBIT1ERR" values="CFD1BDIAG1__DBIT1ERR" />
            <bitfield caption="Data Format Error Status bit" mask="0x08000000" name="DFORMERR" values="CFD1BDIAG1__DFORMERR" />
            <bitfield caption="Data Stuffing Error Status bit" mask="0x10000000" name="DSTUFERR" values="CFD1BDIAG1__DSTUFERR" />
            <bitfield caption="Data CRC Error Status bit" mask="0x20000000" name="DCRCERR" values="CFD1BDIAG1__DCRCERR" />
            <bitfield caption="Error State Indicator (ESI) Flag Status bit" mask="0x40000000" name="ESI" values="CFD1BDIAG1__ESI" />
            <bitfield caption="Data Length Code (DLC) Mismatch Status bit" mask="0x80000000" name="DLCMM" values="CFD1BDIAG1__DLCMM" />
         </register>
         <register caption="Transmit Event FIFO Control Register" name="CFD1TEFCON" offset="0x100" rw="RW" size="4">
            <bitfield caption="Transmit Event FIFO Not Empty Interrupt Enable bit" mask="0x00000001" name="TEFNEIE" values="CFD1TEFCON__TEFNEIE" />
            <bitfield caption="Transmit Event FIFO Half Full Interrupt Enable bit" mask="0x00000002" name="TEFHIE" values="CFD1TEFCON__TEFHIE" />
            <bitfield caption="Transmit Event FIFO Full Interrupt Enable bit" mask="0x00000004" name="TEFFIE" values="CFD1TEFCON__TEFFIE" />
            <bitfield caption="Transmit Event FIFO Overflow Interrupt Enable bit" mask="0x00000008" name="TEFOVIE" values="CFD1TEFCON__TEFOVIE" />
            <bitfield caption="Transmit Event FIFO Time Stamp Enable bit" mask="0x00000020" name="TEFTSEN" values="CFD1TEFCON__TEFTSEN" />
            <bitfield caption="Increment Tail bit" mask="0x00000100" name="UINC" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1TEFCON__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1TEFCON__FSIZE" />
         </register>
