Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/atdf/PIC32MK0512GPH048.atdf
      <value-group caption="Enable Filter n to Accept Messages bits" name="CFD1FLTCON7__FLTEN31">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ0__SID11">
         <value caption="Extended standard identifier to 12-bit" name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ0__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="CFD1MASK0__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="CFD1MASK0__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ1__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ1__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK1__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK1__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ2__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ2__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="CFD1MASK2__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="CFD1MASK2__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ3__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ3__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="CFD1MASK3__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="CFD1MASK3__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ4__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ4__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK4__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
