Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/atdf/PIC32MK0512GPH048.atdf
      <value-group caption="Flash Control Permission Group bits" name="CFGPG__FCPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Permission bits" name="CFGPG__ADCPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Permission Group bits" name="CFGPG__JTAGPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Unable to Lock Status Read-only bit" name="CFGAPP2__POSCFAIL">
         <value caption="Crystal or Resonator usage failed" name="" value="0x0" />
         <value caption="Crystal or resonator is locked or is indeterminate. If successfully locked, clock status is determined bythe SPLLRDY (CLKSTAT(7)) status flag." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01577" name="CLC" version="">
      <register-group name="CLC">
         <register caption="" name="CLC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC1CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC1CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC1CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC1CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC1CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC1CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC1CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC1CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC1CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC1CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC1CON__G4POL" />
         </register>
         <register caption="" name="CLC2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC2CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC2CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC2CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC2CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC2CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC2CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC2CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC2CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC2CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC2CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC2CON__G4POL" />
         </register>
         <register caption="" name="CLC3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC3CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC3CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC3CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC3CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC3CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC3CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC3CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC3CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC3CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC3CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC3CON__G4POL" />
         </register>
         <register caption="" name="CLC4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC4CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC4CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC4CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC4CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC4CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC4CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC4CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC4CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC4CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC4CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC4CON__G4POL" />
         </register>
         <register caption="" name="CLC1SEL" offset="0x10" rw="RW" size="4">
            <bitfield caption="Data Selection MUX 1 Signal Selection bits" mask="0x00000007" name="DS1" values="CLC1SEL__DS1" />
            <bitfield caption="Data Selection MUX 2 Signal Selection bits" mask="0x00000070" name="DS2" values="CLC1SEL__DS2" />
            <bitfield caption="Data Selection MUX 3 Signal Selection bits" mask="0x00000700" name="DS3" values="CLC1SEL__DS3" />
            <bitfield caption="Data Selection MUX 4 Signal Selection bits" mask="0x00007000" name="DS4" values="CLC1SEL__DS4" />
         </register>
         <register caption="" name="CLC2SEL" offset="0x210" rw="RW" size="4">
            <bitfield caption="Data Selection MUX 1 Signal Selection bits" mask="0x00000007" name="DS1" values="CLC2SEL__DS1" />
            <bitfield caption="Data Selection MUX 2 Signal Selection bits" mask="0x00000070" name="DS2" values="CLC2SEL__DS2" />
            <bitfield caption="Data Selection MUX 3 Signal Selection bits" mask="0x00000700" name="DS3" values="CLC2SEL__DS3" />
            <bitfield caption="Data Selection MUX 4 Signal Selection bits" mask="0x00007000" name="DS4" values="CLC2SEL__DS4" />
         </register>
