Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/atdf/PIC32MK0512GPH048.atdf
      <value-group caption="Gate 1 Data Source 4 Negated Enable bit" name="CLC3GLS__G1D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 True Enable bit" name="CLC3GLS__G1D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 1 Negated Enable bit" name="CLC3GLS__G2D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 1 True Enable bit" name="CLC3GLS__G2D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 2 Negated Enable bit" name="CLC3GLS__G2D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 2 True Enable bit" name="CLC3GLS__G2D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 3 Negated Enable bit" name="CLC3GLS__G2D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 3 True Enable bit" name="CLC3GLS__G2D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 4 Negated Enable bit" name="CLC3GLS__G2D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 4 True Enable bit" name="CLC3GLS__G2D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 1 Negated Enable bit" name="CLC3GLS__G3D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 1 True Enable bit" name="CLC3GLS__G3D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 2 Negated Enable bit" name="CLC3GLS__G3D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 2 True Enable bit" name="CLC3GLS__G3D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 3 Negated Enable bit" name="CLC3GLS__G3D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 3 True Enable bit" name="CLC3GLS__G3D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 4 Negated Enable bit" name="CLC3GLS__G3D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 4 True Enable bit" name="CLC3GLS__G3D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 1 Negated Enable bit" name="CLC3GLS__G4D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 1 True Enable bit" name="CLC3GLS__G4D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 2 Negated Enable bit" name="CLC3GLS__G4D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 2 True Enable bit" name="CLC3GLS__G4D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 3 Negated Enable bit" name="CLC3GLS__G4D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 3 True Enable bit" name="CLC3GLS__G4D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 4 Negated Enable bit" name="CLC3GLS__G4D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 4 True Enable bit" name="CLC3GLS__G4D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
