Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/atdf/PIC32MK0512GPH048.atdf
         <register caption="" name="DSGPR27" offset="0x78" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR28" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR29" offset="0x80" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR30" offset="0x84" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR31" offset="0x88" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR32" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
      </register-group>
      <value-group caption="Deep Sleep Enable bit" name="DSCON__DSEN">
         <value caption="Deep Sleep mode is entered on a WAIT command" name="" value="0x1" />
         <value caption="Sleep mode is entered on a WAIT command" name="" value="0x0" />
      </value-group>
      <value-group caption="General Purpose Registers Enable bit" name="DSCON__DSGPREN">
         <value caption="General purpose register retention is enabled in Deep Sleep mode" name="" value="0x1" />
         <value caption="No general purpose register retention in Deep Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Module Disable bit" name="DSCON__RTCDIS">
         <value caption="RTCC module is not enabled" name="" value="0x1" />
         <value caption="RTCC module is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Wake-up Disable bit" name="DSCON__RTCCWDIS">
         <value caption="Wake-up from RTCC is disabled" name="" value="0x1" />
         <value caption="Wake-up from RTCC is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep BOR Event Status bit" name="DSCON__DSBOR">
         <value caption="DSBOREN was enabled and VDD dropped below the DSBOR threshold during Deep Sleep" name="" value="0x1" />
         <value caption="DSBOREN was disabled, or VDD did not drop below the DSBOR threshold during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="I/O Pin State Release bit" name="DSCON__RELEASE">
         <value caption="Upon waking from Deep Sleep, the I/O pins maintain their previous states" name="" value="0x1" />
         <value caption="Release I/O pins and allow their respective TRIS and LAT bits to control their states" name="" value="0x0" />
      </value-group>
      <value-group caption="I/O Pin State Release bit" name="DSWAKE__DSINT0">
         <value caption="Interrupt-on-change was asserted during Deep Sleep" name="" value="0x1" />
         <value caption="Interrupt-on-change was not asserted during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Fault Detected bit" name="DSWAKE__DSFLT">
         <value caption="A Fault occurred during Deep Sleep and some Deep Sleep configuration settings may have been corrupted" name="" value="0x1" />
         <value caption="No Fault was detected during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Time-out bit" name="DSWAKE__DSWDT">
         <value caption="The Deep Sleep Watchdog Timer timed out during Deep Sleep" name="" value="0x1" />
         <value caption="The Deep Sleep Watchdog Timer did not time-out during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Real-Time Clock and Calendar Alarm bit" name="DSWAKE__DSRTC">
         <value caption="The Real-Time Clock and Calendar triggered an alarm during Deep Sleep" name="" value="0x1" />
         <value caption="The Real-Time Clock and Calendar did not trigger an alarm during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="MCLR Event bit" name="DSWAKE__DSMCLR">
         <value caption="The MCLR pin was active and was asserted during Deep Sleep" name="" value="0x1" />
         <value caption="The MCLR pin was not active, or was active, but not asserted during Deep Sleep" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02467" name="GPIO" version="1">
      <register-group name="GPIO">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELA" />
            <bitfield mask="0x00000002" name="ANSELA" />
            <bitfield mask="0x00000004" name="ANSELA" />
            <bitfield mask="0x00000008" name="ANSELA" />
            <bitfield mask="0x00000010" name="ANSELA" />
            <bitfield mask="0x00000020" name="ANSELA" />
            <bitfield mask="0x00000040" name="ANSELA" />
            <bitfield mask="0x00000080" name="ANSELA" />
            <bitfield mask="0x00000100" name="ANSELA" />
            <bitfield mask="0x00000200" name="ANSELA" />
            <bitfield mask="0x00000400" name="ANSELA" />
            <bitfield mask="0x00000800" name="ANSELA" />
            <bitfield mask="0x00001000" name="ANSELA" />
            <bitfield mask="0x00002000" name="ANSELA" />
            <bitfield mask="0x00004000" name="ANSELA" />
            <bitfield mask="0x00008000" name="ANSELA" />
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELB" />
            <bitfield mask="0x00000002" name="ANSELB" />
            <bitfield mask="0x00000004" name="ANSELB" />
            <bitfield mask="0x00000008" name="ANSELB" />
            <bitfield mask="0x00000010" name="ANSELB" />
            <bitfield mask="0x00000020" name="ANSELB" />
            <bitfield mask="0x00000040" name="ANSELB" />
            <bitfield mask="0x00000080" name="ANSELB" />
            <bitfield mask="0x00000100" name="ANSELB" />
            <bitfield mask="0x00000200" name="ANSELB" />
            <bitfield mask="0x00000400" name="ANSELB" />
            <bitfield mask="0x00000800" name="ANSELB" />
            <bitfield mask="0x00001000" name="ANSELB" />
            <bitfield mask="0x00002000" name="ANSELB" />
            <bitfield mask="0x00004000" name="ANSELB" />
            <bitfield mask="0x00008000" name="ANSELB" />
         </register>
         <register caption="" name="ANSELC" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELC" />
            <bitfield mask="0x00000002" name="ANSELC" />
            <bitfield mask="0x00000004" name="ANSELC" />
            <bitfield mask="0x00000008" name="ANSELC" />
            <bitfield mask="0x00000010" name="ANSELC" />
            <bitfield mask="0x00000020" name="ANSELC" />
            <bitfield mask="0x00000040" name="ANSELC" />
            <bitfield mask="0x00000080" name="ANSELC" />
            <bitfield mask="0x00000100" name="ANSELC" />
            <bitfield mask="0x00000200" name="ANSELC" />
            <bitfield mask="0x00000400" name="ANSELC" />
            <bitfield mask="0x00000800" name="ANSELC" />
            <bitfield mask="0x00001000" name="ANSELC" />
            <bitfield mask="0x00002000" name="ANSELC" />
            <bitfield mask="0x00004000" name="ANSELC" />
            <bitfield mask="0x00008000" name="ANSELC" />
         </register>
         <register caption="" name="ANSELD" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELD" />
            <bitfield mask="0x00000002" name="ANSELD" />
            <bitfield mask="0x00000004" name="ANSELD" />
            <bitfield mask="0x00000008" name="ANSELD" />
            <bitfield mask="0x00000010" name="ANSELD" />
            <bitfield mask="0x00000020" name="ANSELD" />
            <bitfield mask="0x00000040" name="ANSELD" />
            <bitfield mask="0x00000080" name="ANSELD" />
            <bitfield mask="0x00000100" name="ANSELD" />
            <bitfield mask="0x00000200" name="ANSELD" />
            <bitfield mask="0x00000400" name="ANSELD" />
            <bitfield mask="0x00000800" name="ANSELD" />
            <bitfield mask="0x00001000" name="ANSELD" />
            <bitfield mask="0x00002000" name="ANSELD" />
            <bitfield mask="0x00004000" name="ANSELD" />
            <bitfield mask="0x00008000" name="ANSELD" />
         </register>
         <register caption="" name="ANSELE" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELE" />
            <bitfield mask="0x00000002" name="ANSELE" />
            <bitfield mask="0x00000004" name="ANSELE" />
            <bitfield mask="0x00000008" name="ANSELE" />
            <bitfield mask="0x00000010" name="ANSELE" />
            <bitfield mask="0x00000020" name="ANSELE" />
            <bitfield mask="0x00000040" name="ANSELE" />
            <bitfield mask="0x00000080" name="ANSELE" />
            <bitfield mask="0x00000100" name="ANSELE" />
            <bitfield mask="0x00000200" name="ANSELE" />
            <bitfield mask="0x00000400" name="ANSELE" />
            <bitfield mask="0x00000800" name="ANSELE" />
            <bitfield mask="0x00001000" name="ANSELE" />
            <bitfield mask="0x00002000" name="ANSELE" />
            <bitfield mask="0x00004000" name="ANSELE" />
            <bitfield mask="0x00008000" name="ANSELE" />
         </register>
         <register caption="" name="ANSELF" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELF" />
            <bitfield mask="0x00000002" name="ANSELF" />
            <bitfield mask="0x00000004" name="ANSELF" />
            <bitfield mask="0x00000008" name="ANSELF" />
            <bitfield mask="0x00000010" name="ANSELF" />
            <bitfield mask="0x00000020" name="ANSELF" />
            <bitfield mask="0x00000040" name="ANSELF" />
            <bitfield mask="0x00000080" name="ANSELF" />
            <bitfield mask="0x00000100" name="ANSELF" />
            <bitfield mask="0x00000200" name="ANSELF" />
            <bitfield mask="0x00000400" name="ANSELF" />
            <bitfield mask="0x00000800" name="ANSELF" />
            <bitfield mask="0x00001000" name="ANSELF" />
            <bitfield mask="0x00002000" name="ANSELF" />
            <bitfield mask="0x00004000" name="ANSELF" />
            <bitfield mask="0x00008000" name="ANSELF" />
         </register>
         <register caption="" name="ANSELG" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELG" />
            <bitfield mask="0x00000002" name="ANSELG" />
            <bitfield mask="0x00000004" name="ANSELG" />
            <bitfield mask="0x00000008" name="ANSELG" />
            <bitfield mask="0x00000010" name="ANSELG" />
            <bitfield mask="0x00000020" name="ANSELG" />
            <bitfield mask="0x00000040" name="ANSELG" />
            <bitfield mask="0x00000080" name="ANSELG" />
            <bitfield mask="0x00000100" name="ANSELG" />
            <bitfield mask="0x00000200" name="ANSELG" />
            <bitfield mask="0x00000400" name="ANSELG" />
            <bitfield mask="0x00000800" name="ANSELG" />
            <bitfield mask="0x00001000" name="ANSELG" />
            <bitfield mask="0x00002000" name="ANSELG" />
            <bitfield mask="0x00004000" name="ANSELG" />
            <bitfield mask="0x00008000" name="ANSELG" />
         </register>
