Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/atdf/PIC32MK0512GPH048.atdf
      <value-group caption="Interrupt with Priority Level 4 Shadow Set bits" name="PRISS__PRI4SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 5" name="" value="0x5" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 4" name="" value="0x4" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 3" name="" value="0x3" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 2" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 5 Shadow Set bits" name="PRISS__PRI5SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 5" name="" value="0x5" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 4" name="" value="0x4" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 3" name="" value="0x3" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 2" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 6 Shadow Set bits" name="PRISS__PRI6SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 5" name="" value="0x5" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 4" name="" value="0x4" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 3" name="" value="0x3" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 2" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 7 Shadow Set bits" name="PRISS__PRI7SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 5" name="" value="0x5" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 4" name="" value="0x4" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 3" name="" value="0x3" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 2" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02869" name="JTAG" version="2">
      <register-group name="JTAG">
         <register caption="" name="_ICDCON" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CKSWBKEN" />
            <bitfield mask="0x00000002" name="SLPBKEN" />
            <bitfield mask="0x00000004" name="WDTBKEN" />
            <bitfield mask="0x00000008" name="WDTEN" />
            <bitfield mask="0x00000010" name="RSTBUG" />
            <bitfield mask="0x00000020" name="DMTBKEN" />
            <bitfield mask="0x00000040" name="DMTEN" />
            <bitfield mask="0x00004000" name="FRZ" />
         </register>
         <register caption="" name="_ICDSTAT" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CKSWBF" />
            <bitfield mask="0x00000002" name="SLPBF" />
            <bitfield mask="0x00000004" name="WDTBF" />
            <bitfield mask="0x00000008" name="DMTBF" />
            <bitfield mask="0x00000010" name="WDTRUNBF" />
            <bitfield mask="0x00000020" name="WDTSLPBF" />
         </register>
      </register-group>
   </module>
